app/controllers/todo_lists_controller.rb

  def show
    @todo_list = TodoList.find(params[:id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @todo_list = TodoList.find(params[:id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "7"]]

  def create
    if not params[:include_date].nil?
    	@todo_list = TodoList.new(params[:todo_list])
    else
        @todo_list = TodoList.new
        @todo_list.description = params[:todo_list][:description]
    end

    @todo_list.completed = false

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("completed", "created_at", "date", "description", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed", nil], ["created_at", Thu, 05 Apr 2012 06:08:50 UTC +00:00], ["date", nil], ["description", "Do something"], ["updated_at", Thu, 05 Apr 2012 06:08:50 UTC +00:00]]

  def update
    if not params[:include_date].nil?
      @todo_list = TodoList.find(params[:id])
      @todo_list.date = params[:date]
    else
      @todo_list = TodoList.find(params[:id])
      @todo_list.date = nil
    end

    @todo_list.completed = false

    respond_to do |format|
      if @todo_list.update_attributes(params[:todo_list])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "todo_lists" SET "date" = '2012-04-05', "updated_at" = '2012-04-05 05:43:16.496831' WHERE "todo_lists"."id" = 12

  def destroy
    @todo_list = TodoList.find(params[:id])
    @todo_list.destroy
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 1]]