app/controllers/view_completed_controller.rb

  def add_to_completed
    @ids = params[':tasks']

    if not @ids.nil?
      @ids.each do |id|
        TodoList.find(id).update_attributes(:completed => true)
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "todo_lists" SET "completed" = 't', "updated_at" = '2012-04-05 07:04:37.132089' WHERE "todo_lists"."id" = 4